[
  {
    "serviceName": "Professional Home Deep Cleaning",
    "category": "cleaning",
    "priceperhour": 45,
    "priceContact": false,
    "description": "Our professional home deep cleaning service provides thorough and comprehensive cleaning of your entire living space. Our trained cleaners use eco-friendly products and specialized equipment to remove deep-seated dirt, grime, and allergens from every corner of your home. We focus on hard-to-reach areas, sanitizing bathrooms and kitchens, dusting all surfaces, and ensuring your home sparkles from top to bottom. Our team pays special attention to detail, cleaning inside cabinets, behind appliances, and in all those neglected spaces. We use HEPA-filter vacuums to capture microscopic particles and steam cleaning for sanitization. Regular deep cleaning not only maintains your home's appearance but also contributes to a healthier living environment by reducing allergens and bacteria. Our service includes comprehensive kitchen cleaning, bathroom sanitization, living area detailing, bedroom organization, and floor care treatment.",
    "serviceurl": "https://images.unsplash.com/photo-1581578731548-c64695cc6952?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Clean Masters Pro",
    "provideremail": "info@cleanmasterspro.com",
    "providerimage": "https://images.unsplash.com/photo-1560250056-07ba64664864?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0101",
    "providerexperence": "8 years",
    "serviceReview": 4.5
  },
  {
    "serviceName": "Emergency Electrical Repair",
    "category": "electrical",
    "priceperhour": 85,
    "priceContact": true,
    "description": "Our emergency electrical repair service provides immediate solutions for all your electrical emergencies with certified electricians available 24/7. We handle everything from power outages and circuit breaker issues to faulty wiring and electrical hazards. Our licensed electricians arrive fully equipped with the latest diagnostic tools and safety equipment to quickly identify and resolve electrical problems. We prioritize safety above all else, ensuring that all repairs meet national electrical code standards. Our services include troubleshooting electrical faults, repairing damaged wiring, replacing faulty outlets and switches, fixing circuit breaker problems, and addressing power surge issues. We also provide electrical safety inspections to prevent future emergencies. Our team is trained in handling high-voltage systems and complex electrical configurations, ensuring your home or business remains safe and functional. We use only high-quality materials and follow strict safety protocols.",
    "serviceurl": "https://images.unsplash.com/photo-1621905252507-b35492cc74b4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "SafeWire Electrical",
    "provideremail": "service@safewire.com",
    "providerimage": "https://images.unsplash.com/photo-1581093458791-8a0a1aa1b25e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0102",
    "providerexperence": "12 years",
    "serviceReview": 4.2
  },
  {
    "serviceName": "Residential Plumbing Solutions",
    "category": "plumbing",
    "priceperhour": 75,
    "priceContact": false,
    "description": "Our comprehensive residential plumbing service covers all aspects of home plumbing systems with expert precision and reliability. We specialize in fixing leaks, unclogging drains, repairing water heaters, and installing new plumbing fixtures. Our licensed plumbers use state-of-the-art equipment including hydro-jetting machines for drain cleaning, video inspection cameras for precise diagnostics, and trenchless technology for pipe repair. We handle everything from minor drips to major pipe replacements, ensuring your plumbing system functions optimally. Our services include leak detection and repair, drain and sewer cleaning, water heater installation and repair, toilet and faucet repairs, pipe replacement, and water pressure adjustment. We also provide preventive maintenance services to help you avoid costly repairs in the future. All our work comes with a satisfaction guarantee and we use only high-quality, durable materials that meet industry standards for longevity and performance.",
    "serviceurl": "https://images.unsplash.com/photo-1558618047-3c8c76ca7d13?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Flow Perfect Plumbers",
    "provideremail": "contact@flowperfect.com",
    "providerimage": "https://images.unsplash.com/photo-1585747860715-2ba37e788b70?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0103",
    "providerexperence": "15 years",
    "serviceReview": 5
  },
  {
    "serviceName": "Custom Cabinet Making",
    "category": "carpentry",
    "priceperhour": 65,
    "priceContact": true,
    "description": "Our custom cabinet making service offers bespoke woodworking solutions tailored to your specific needs and space requirements. We create beautiful, functional cabinets using premium materials and traditional craftsmanship combined with modern techniques. Each cabinet is custom-designed to maximize your storage space while enhancing your room's aesthetics. We work with various wood types including oak, maple, cherry, and walnut, and can match existing furniture or create entirely new designs. Our process begins with a detailed consultation to understand your needs, followed by precise measurements and design proposals. We then craft your cabinets in our workshop using joinery techniques that ensure durability and longevity. Our services include kitchen cabinets, bathroom vanities, entertainment centers, bookshelves, and custom storage solutions. We also provide installation, finishing, and hardware selection assistance. Every project receives our complete attention to detail, from the initial design to the final installation.",
    "serviceurl": "https://images.unsplash.com/photo-1556912165-f556f1f39fdf?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Artisan Wood Crafts",
    "provideremail": "crafts@artisanwood.com",
    "providerimage": "https://images.unsplash.com/photo-1595475888562-7d2d34a7ecb4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0104",
    "providerexperence": "20 years",
    "serviceReview": 4.3
  },
  {
    "serviceName": "Interior House Painting",
    "category": "painting",
    "priceperhour": 55,
    "priceContact": false,
    "description": "Our professional interior house painting service transforms your living spaces with precision and care. We provide complete interior painting solutions including surface preparation, color consultation, and flawless execution. Our team of experienced painters uses high-quality paints and proper techniques to ensure a smooth, durable finish that enhances your home's beauty. We begin with thorough surface preparation including cleaning, sanding, and repairing any imperfections. We then use professional-grade tools and techniques for application, ensuring even coverage and clean lines. Our services include wall painting, ceiling painting, trim work, accent walls, and decorative finishes. We also handle furniture protection and post-painting cleanup. We work with all types of paint finishes from matte to high-gloss and can help you choose the right products for each room's specific needs. Our attention to detail ensures crisp edges, smooth surfaces, and professional results that last for years.",
    "serviceurl": "https://images.unsplash.com/photo-1586023492125-27b2c045efd7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Color Perfect Painters",
    "provideremail": "paint@colorperfect.com",
    "providerimage": "https://images.unsplash.com/photo-1513475382585-d06e58bcb0e0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0105",
    "providerexperence": "10 years",
    "serviceReview": 4.2
  },
  {
    "serviceName": "Office Commercial Cleaning",
    "category": "cleaning",
    "priceperhour": 60,
    "priceContact": true,
    "description": "Professional office commercial cleaning service designed to maintain pristine working environments for businesses of all sizes. Our comprehensive cleaning program includes daily maintenance cleaning as well as periodic deep cleaning services. We understand the importance of a clean, hygienic workspace for employee productivity and client impressions. Our trained cleaning staff follows strict protocols using commercial-grade equipment and EPA-approved disinfectants. Services include dusting and wiping all surfaces, vacuuming and mopping floors, sanitizing restrooms and break areas, cleaning windows and glass surfaces, emptying trash receptacles, and maintaining entryways. We also offer specialized services such as carpet cleaning, upholstery cleaning, and high-dusting. Our flexible scheduling allows for after-hours cleaning to minimize disruption to your business operations. We conduct regular quality inspections and provide detailed cleaning reports. Our eco-friendly cleaning options are available for businesses pursuing green certifications.",
    "serviceurl": "https://images.unsplash.com/photo-1497366754035-f200968a6e72?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Corporate Clean Solutions",
    "provideremail": "service@corporateclean.com",
    "providerimage": "https://images.unsplash.com/photo-1564061170517-d3907caa96ea?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0106",
    "providerexperence": "7 years",
    "serviceReview": 4.1
  },
  {
    "serviceName": "Electrical Panel Upgrade",
    "category": "electrical",
    "priceperhour": 95,
    "priceContact": true,
    "description": "Professional electrical panel upgrade service to enhance your home's electrical capacity and safety. We specialize in replacing outdated electrical panels with modern, code-compliant systems that can handle today's electrical demands. Our licensed electricians assess your current electrical usage and recommend the appropriate panel upgrade to ensure safe, reliable power distribution throughout your home. We handle everything from simple panel replacements to complete service upgrades, including new meter bases and grounding systems. Our services include replacing fuse boxes with circuit breaker panels, upgrading to higher amperage services (200A, 400A), installing whole-house surge protection, adding sub-panels for additions or workshops, and ensuring proper grounding and bonding. We obtain all necessary permits and arrange for utility company coordination. Safety is our top priority, and we follow strict protocols to ensure your new electrical panel meets all current National Electrical Code requirements. We use only UL-listed panels and components from reputable manufacturers.",
    "serviceurl": "https://images.unsplash.com/photo-1621905251189-08d45b3daddf?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "PowerPro Electric",
    "provideremail": "upgrades@powerpro.com",
    "providerimage": "https://images.unsplash.com/photo-1581094794329-c6fe63c8d7e1?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0107",
    "providerexperence": "14 years",
    "serviceReview": 4.3
  },
  {
    "serviceName": "Water Heater Installation",
    "category": "plumbing",
    "priceperhour": 80,
    "priceContact": false,
    "description": "Professional water heater installation service for both traditional tank-style and modern tankless systems. We help homeowners choose the right water heater for their needs based on household size, water usage patterns, and energy efficiency goals. Our certified plumbers are experienced in installing all types of water heaters including gas, electric, hybrid heat pump, and tankless models. We handle complete installation from removal of old units to proper setup of new systems, including all necessary plumbing connections, electrical wiring, gas line work, and ventilation requirements. Our installation service includes proper sizing calculations, code-compliant installation, pressure relief valve installation, expansion tank when required, and thorough testing. We also provide guidance on maintenance to extend your water heater's lifespan and maximize efficiency. All our installations include warranty registration and we use only high-quality water heaters from reputable manufacturers. We ensure proper disposal of old units according to environmental regulations.",
    "serviceurl": "https://images.unsplash.com/photo-1601371517347-8e341d7db14c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Aqua Thermal Solutions",
    "provideremail": "install@aquathermal.com",
    "providerimage": "https://images.unsplash.com/photo-1621905252507-b35492cc74b4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0108",
    "providerexperence": "11 years",
    "serviceReview":4
  },
  {
    "serviceName": "Custom Furniture Building",
    "category": "carpentry",
    "priceperhour": 70,
    "priceContact": true,
    "description": "Artisanal custom furniture building service creating unique, handcrafted pieces that become family heirlooms. We work closely with clients to design and build furniture that perfectly fits their space, style, and functional needs. Our master craftsmen use traditional woodworking techniques combined with modern precision tools to create pieces of exceptional quality and beauty. We specialize in various furniture types including dining tables, chairs, beds, bookshelves, desks, and entertainment centers. Each project begins with detailed consultations to understand your vision, followed by design drawings and material selection. We work with a wide range of wood species from domestic hardwoods to exotic imports, and can incorporate other materials like glass, metal, or stone. Our construction methods emphasize durability and longevity, using techniques like mortise and tenon joinery, dovetail joints, and proper wood movement accommodation. We offer various finishing options from natural oil finishes to durable lacquers, and can match existing furniture finishes. Every piece is built to last generations with proper care.",
    "serviceurl": "https://images.unsplash.com/photo-1586023492125-27b2c045efd7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Heritage Woodworks",
    "provideremail": "furniture@heritagewood.com",
    "providerimage": "https://images.unsplash.com/photo-1595475888562-7d2d34a7ecb4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0109",
    "providerexperence": "18 years",
    "serviceReview": 5
  },
  {
    "serviceName": "Exterior House Painting",
    "category": "painting",
    "priceperhour": 65,
    "priceContact": false,
    "description": "Professional exterior house painting service that protects and enhances your home's curb appeal while withstanding the elements. We provide comprehensive exterior painting using high-quality, weather-resistant paints and proper surface preparation techniques. Our experienced painting crews are trained in working at heights safely and efficiently. We begin with thorough surface preparation including pressure washing, scraping loose paint, sanding rough areas, and repairing damaged surfaces. We then apply premium primers and multiple coats of high-quality exterior paint designed to withstand sun, rain, and temperature fluctuations. Our services include siding painting, trim work, door painting, shutters, decks, fences, and other exterior surfaces. We also handle caulking and sealing to prevent moisture intrusion. We use proper techniques for different surface materials including wood, vinyl, brick, stucco, and metal. Our attention to detail ensures crisp lines, even coverage, and professional results that last for years. We take pride in transforming homes with beautiful, durable finishes that protect your investment.",
    "serviceurl": "https://images.unsplash.com/photo-1419064642531-e575728abf66?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "WeatherGuard Painters",
    "provideremail": "exterior@weatherguard.com",
    "providerimage": "https://images.unsplash.com/photo-1513475382585-d06e58bcb0e0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0110",
    "providerexperence": "12 years",
    "serviceReview": 4.2
  },
  {
    "serviceName": "Move-In/Move-Out Cleaning",
    "category": "cleaning",
    "priceperhour": 50,
    "priceContact": false,
    "description": "Comprehensive move-in/move-out cleaning service designed to ensure properties are spotless for new occupants or to secure security deposits for outgoing tenants. Our detailed cleaning process covers every inch of the property from top to bottom. We understand the importance of thorough cleaning during transitions and follow a meticulous checklist to ensure no area is overlooked. Our services include deep cleaning of kitchens (inside appliances, cabinets, and drawers), detailed bathroom sanitization (including grout cleaning and fixture polishing), complete floor care (scrubbing, mopping, vacuuming), window and sill cleaning, interior glass surfaces, dusting all surfaces including ceilings and light fixtures, and cleaning all closets and storage areas. We pay special attention to areas often missed in regular cleaning such as baseboards, door frames, switch plates, and ventilation covers. Our team uses professional-grade cleaning equipment and eco-friendly products that effectively remove dirt, grime, and bacteria without harsh chemical residues. We provide before-and-after documentation for landlords and tenants.",
    "serviceurl": "https://images.unsplash.com/photo-1581578731548-c64695cc6952?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Transition Clean Experts",
    "provideremail": "move@transitionclean.com",
    "providerimage": "https://images.unsplash.com/photo-1560250056-07ba64664864?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0111",
    "providerexperence": "6 years",
    "serviceReview": 4.4
  },
  {
    "serviceName": "Ceiling Fan Installation",
    "category": "electrical",
    "priceperhour": 75,
    "priceContact": false,
    "description": "Professional ceiling fan installation service that improves air circulation and energy efficiency in your home. We install all types of ceiling fans including standard, low-profile, dual-motor, and smart fans with remote controls or app integration. Our licensed electricians ensure proper installation for optimal performance and safety. We begin by assessing your room size and ceiling height to recommend the appropriate fan size and style. Our installation service includes secure mounting to ceiling joists, proper electrical wiring, installation of wall controls or remote systems, and balancing the fan for smooth, quiet operation. We handle both new installations and replacements of existing fans, including updating electrical boxes to support the weight and movement of ceiling fans. Our services also include troubleshooting existing fan problems such as wobbling, noise issues, or remote control malfunctions. We ensure all installations meet electrical code requirements and include proper grounding. For vaulted or sloped ceilings, we use appropriate downrod angles to ensure optimal air movement. We can also install multiple fans with synchronized controls for whole-house comfort.",
    "serviceurl": "https://images.unsplash.com/photo-1586023492125-27b2c045efd7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "AirFlow Electric",
    "provideremail": "fans@airflowelectric.com",
    "providerimage": "https://images.unsplash.com/photo-1581093458791-8a0a1aa1b25e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0112",
    "providerexperence": "9 years",
    "serviceReview": 4.7
  },
  {
    "serviceName": "Bathroom Plumbing Renovation",
    "category": "plumbing",
    "priceperhour": 90,
    "priceContact": true,
    "description": "Complete bathroom plumbing renovation service that transforms your bathroom with updated fixtures and efficient plumbing systems. We handle all aspects of bathroom plumbing from simple fixture replacements to complete rough-in plumbing for full bathroom remodels. Our licensed plumbers work closely with homeowners and contractors to ensure plumbing systems meet current codes and provide reliable performance for years to come. Our services include installing new toilets, sinks, faucets, showers, tubs, and bidets. We specialize in converting standard showers to luxurious walk-in showers with multiple shower heads and body sprays. We handle drain and vent system installation, water supply line updates, and proper waste line configuration. For luxury upgrades, we install rainfall shower systems, thermostatic mixing valves, and smart toilets. We also address common bathroom plumbing issues like poor water pressure, slow drains, and inadequate hot water supply. Our renovation work includes proper waterproofing behind walls and under floors to prevent moisture damage. We coordinate with other trades to ensure seamless integration of plumbing with tile work, cabinetry, and electrical systems.",
    "serviceurl": "https://images.unsplash.com/photo-1552321554-5fefe8c9ef14?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Bath Pro Plumbers",
    "provideremail": "renovation@bathpro.com",
    "providerimage": "https://images.unsplash.com/photo-1585747860715-2ba37e788b70?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0113",
    "providerexperence": "16 years",
    "serviceReview": 4.8
  },
  {
    "serviceName": "Deck Building and Repair",
    "category": "carpentry",
    "priceperhour": 70,
    "priceContact": true,
    "description": "Professional deck building and repair service creating beautiful outdoor living spaces that enhance your home's value and enjoyment. We design and build custom decks using quality materials and construction techniques that ensure durability and safety. Our experienced carpenters work with various materials including pressure-treated wood, composite decking, cedar, redwood, and tropical hardwoods. We begin with detailed consultations to understand your vision, usage needs, and budget, then create custom designs that complement your home's architecture and landscape. Our deck building services include new deck construction, deck expansions, multi-level decks, covered decks with pergolas or roofs, and deck additions like built-in seating, planters, or lighting. We also specialize in deck repairs including replacing damaged boards, reinforcing structures, fixing loose railings, and addressing safety hazards. Our construction methods emphasize proper footings, structural integrity, and code compliance. We use hidden fastening systems for clean appearances and proper water drainage techniques to prevent rot. All our decks are built to withstand local weather conditions and include proper railings and safety features.",
    "serviceurl": "https://images.unsplash.com/photo-1519710164239-da123c03c2c0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Outdoor Living Carpentry",
    "provideremail": "decks@outdoorliving.com",
    "providerimage": "https://images.unsplash.com/photo-1595475888562-7d2d34a7ecb4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0114",
    "providerexperence": "13 years",
    "serviceReview":4.8
  },
  {
    "serviceName": "Cabinet Refinishing",
    "category": "painting",
    "priceperhour": 60,
    "priceContact": false,
    "description": "Professional cabinet refinishing service that transforms outdated kitchen and bathroom cabinets without the cost of replacement. We use specialized techniques and high-quality products to refresh your cabinets with beautiful, durable finishes. Our process begins with thorough cleaning and degreasing to remove years of kitchen grime. We then carefully sand all surfaces to create the ideal foundation for new finishes. For painted finishes, we apply premium primers and multiple coats of hard-wearing cabinet paint using spray equipment for smooth, factory-like results. For stained finishes, we use professional-grade stains and clear coats that enhance the wood's natural beauty while providing protection. Our services include complete cabinet refinishing, hardware installation, interior cabinet cleaning and organization, and optional add-ons like new hinges, pulls, or organizational inserts. We work efficiently to minimize disruption to your household, using proper dust containment systems and ventilation. Our finishes are designed to withstand daily use, cleaning, and moisture exposure. We offer a wide range of color options and can match existing decor or help you choose a completely new look that modernizes your space.",
    "serviceurl": "https://images.unsplash.com/photo-1556909114-4d0d853e5e21?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "Cabinet Renew Specialists",
    "provideremail": "refinish@cabinetrenew.com",
    "providerimage": "https://images.unsplash.com/photo-1513475382585-d06e58bcb0e0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0115",
    "providerexperence": "8 years",
    "serviceReview": 4.7
  },
  {
    "serviceName": "Post-Construction Cleaning",
    "category": "cleaning",
    "priceperhour": 55,
    "priceContact": true,
    "description": "Specialized post-construction cleaning service designed to remove all construction debris, dust, and residues from newly built or renovated spaces. We understand the unique challenges of construction cleanup and have developed systematic approaches to transform construction sites into move-in ready spaces. Our multi-phase cleaning process begins with rough cleaning to remove large debris, followed by detailed cleaning of every surface. We use industrial-grade HEPA-filter vacuums to capture fine construction dust that ordinary cleaning misses. Our services include removal of protective coverings and labels, detailed window cleaning inside and out, thorough dusting of all surfaces including ceilings, walls, and fixtures, cabinet interior and exterior cleaning, appliance installation preparation, floor cleaning and polishing, and final touch-up cleaning. We pay special attention to areas where construction dust accumulates like HVAC vents, light fixtures, window tracks, and behind appliances. Our team is trained to identify and safely remove various construction residues including drywall dust, sawdust, adhesive residues, and paint overspray. We use appropriate cleaning solutions for different surfaces to avoid damage while ensuring complete cleanliness. Our final inspection ensures every detail meets our high standards.",
    "serviceurl": "https://images.unsplash.com/photo-1504307651254-35680f356dfd?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "BuildClean Professionals",
    "provideremail": "construction@buildclean.com",
    "providerimage": "https://images.unsplash.com/photo-1560250056-07ba64664864?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0116",
    "providerexperence": "5 years",
    "serviceReview":4.8
  },
  {
    "serviceName": "Whole House Rewiring",
    "category": "electrical",
    "priceperhour": 100,
    "priceContact": true,
    "description": "Comprehensive whole house rewiring service for older homes with outdated or unsafe electrical systems. We completely replace aging electrical wiring with modern, code-compliant systems that provide safe, reliable power for today's electrical demands. Our licensed electricians are experienced in working with historic homes while bringing electrical systems up to current safety standards. We begin with a thorough assessment of your existing electrical system and create a detailed rewiring plan that minimizes disruption to your home and family. Our rewiring service includes replacement of old knob-and-tube or aluminum wiring with modern copper wiring, installation of new circuit breaker panels with adequate",
    "serviceurl": "https://images.unsplash.com/photo-1504307651254-35680f356dfd?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "providername": "BuildClean Professionals",
    "provideremail": "construction@buildclean.com",
    "providerimage": "https://images.unsplash.com/photo-1560250056-07ba64664864?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80",
    "providernumber": "+1-555-0116",
    "providerexperence": "5 years",
    "serviceReview":4.8
}
]